app/Domain/User/Rules/MatchSchoolClass.php

select * from `schools` where `schools`.`id` = '51' limit 1
select * from `school_classes` where `school_id` = 51 and `id` = '194' limit 1
---
    public function passes($attribute, $value)
    {
        if(empty($this->schoolId) || !$this->schoolId && !$value) return true;
        $school = School::find($this->schoolId);

        $class = SchoolClass::where('school_id', $school->id)->where('id', $value)->first();